#include "Texts.h"


QString classic_0=R"(古典音乐，是音乐的一种类型。古典音乐有广义、狭义之分。
    广义是指那些从西方中世纪开始的、在欧洲主流文化背景下创作的西方古典音乐，主要因其复杂多样的创作技术和所能承载的厚重内涵而有别于通俗音乐和民间音乐。
    狭义指古典主义时期，1750年（J·S·巴赫去世）至1827年（贝多芬去世），这一时期为古典主义音乐时期，它包含了两大时间段：“前古典时期”和“维也纳古典时期”。
    “最为著名的维也纳乐派也是在“维也纳古典时期”兴起，其代表作曲家有海顿、莫扎特和贝多芬，被后世称为“维也纳三杰”。)";
QString classic_1=R"(古典音乐的起源可以追溯到中世纪和文艺复兴时期。在中世纪，宗教音乐是最早的形式之一，用于基督教礼拜和仪式。随着时间的推移，音乐开始在教堂以外的场所演奏，出现了单声部的声乐作品和简单的器乐曲目。
    文艺复兴时期（大约在15至17世纪之间）见证了音乐风格和形式的进一步发展。音乐家们开始采用复调的技术，创作出更加复杂和精致的作品。
    巴洛克时期（17至18世纪）是古典音乐发展的又一个高峰期。
    总的来说，古典音乐的起源经历了从简单的宗教音乐到复杂的复调和器乐作品的演变过程。这些早期的作品不仅为后来的音乐风格奠定了基础，也反映了当时社会、文化和宗教生活的重要特征。
    )";
QString classic_2=R"(
    古典音乐是指起源于欧洲文化传统的音乐形式，通常涵盖了从约1600年至约1750年的巴洛克时期，以及从约1750年至约1830年的古典时期和浪漫时期。
    古典音乐以其复杂的音乐结构、严谨的形式、以及对和声和旋律的精细处理而著称。它的主要分类包括交响乐、室内乐、歌剧、协奏曲和声乐作品等。
    交响乐以管弦乐队演奏，室内乐则以小型乐团或独奏为主，体现了音乐家对不同乐器组合的探索和创新。歌剧则将音乐与戏剧相结合，通过歌唱和表演讲述故事。
    协奏曲则突出了独奏家与管弦乐队之间的对话和竞争。整体而言，古典音乐不仅以其技术上的成就和音乐形式的丰富性而闻名，也代表了其时代社会、文化背景下的艺术成就和精神追求。
)";
QString classic_3="斯特劳斯《蓝色多瑙河》 贝多芬《命运交响曲》 莫扎《魔笛》";

QString jazz_0=R"(
    爵士音乐（Jazz），音乐类型，于19世纪末20世纪初源于美国，诞生于南部港口城市新奥尔良，音乐根基来自布鲁斯（Blues）和拉格泰姆（Ragtime）。
    爵士乐讲究即兴，以具有摇摆特点的Shuffle节奏为基础，是非洲黑人文化和欧洲白人文化的结合。20世纪前十几年爵士乐主要集中在新奥尔良发展，1917年后转向芝加哥，30年代又转移至纽约，爵士乐风靡全球。
    爵士乐的主要风格有：新奥尔良爵士乐、摇摆乐、比博普、冷爵士、自由爵士乐、拉丁爵士、融合爵士等。)";
QString jazz_1=R"(
    爵士音乐起源于19世纪末的美国南部，融合了非洲音乐传统、欧洲音乐元素以及美国本土音乐风格。它最初在新奥尔良等城市的黑人社区中形成，反映了当时社会和文化的多样性和变化。
    爵士音乐以其富有节奏感和即兴表演为特点，通常使用蓝调音阶、复调和强调节奏的特征。它的发展受到多种音乐形式的影响，包括布鲁斯、福音音乐、民间音乐和拉丁音乐等。
    爵士音乐在20世纪初蓬勃发展，成为了美国文化的重要组成部分，并且对全球音乐产生了深远影响，塑造了现代音乐的多样性和创新性。
    )";
QString jazz_2="爵士音乐多样且丰富，主要分为新奥尔良爵士、摇摆爵士、比博普爵士、硬爵士、自由爵士、后爵士及爵士摇滚等流派。其特点包括即兴创作、复杂的和声、蓝调元素、复杂的节奏和灵活的演奏风格。爵士以其独特的音乐语言和社会文化的反映，成为全球音乐界不可或缺的一部分，持续影响着现代音乐的发展和演变。";
QString jazz_3="Louis Armstrong：What A Wonderful World\nJelly Roll Morton:The Crave";

QString rock_0="摇滚（Rock and Roll）是一种音乐类型，起源于20世纪40年代末期的美国，20世纪50年代早期开始流行，迅速风靡全球。摇滚乐以其灵活大胆的表现形式和富有激情的音乐节奏表达情感，受到了全世界大多数人的喜爱，并在1960年和1970年形成一股热潮。99999999999999999999999999999999999999999999999999999";
QString rock_1="摇滚音乐起源于20世纪50年代的美国，融合了蓝调、民谣、节奏布鲁斯和乡村音乐的元素。它最初由电吉他、贝斯吉他和鼓组成，强调强烈的节奏和突出的吉他演奏，展现出前所未有的音乐力量和能量。艺术家如艾尔维斯·普雷斯利、小理查德和查克·贝里等，通过他们的音乐表达和舞台表演，开创了这一革命性的音乐风格。摇滚不仅成为一种音乐形式，更是年轻一代文化与社会观念的象征，激发了全球范围内青年的激情和创造力。";
QString rock_2="摇滚音乐涵盖广泛，主要流派包括经典摇滚、硬摇滚、朋克摇滚、重金属、另类摇滚和后摇滚等。经典摇滚强调吉他、贝斯和鼓的核心组合，具有强烈的节奏感和动能；硬摇滚则更加重视高音量和强烈的吉他演奏，常伴有高能量的表演风格；朋克摇滚则注重简约、直接和反叛的音乐特征；而重金属则以厚重的吉他声和深沉的主题著称。另类摇滚和后摇滚则突破传统边界，注重创新和实验性的音乐探索。摇滚音乐以其直接、激情和反叛的态度，不仅塑造了青少年文化，也对现代音乐的多个领域产生了深远的影响。";
QString rock_3="Chuck Berry：Little Queenie AC/DC：Back In Black The Beatles：Don't let me down";


QString pop_0="流行音乐19世纪末20世纪初起源于美国，从音乐体系看，流行音乐是在叮砰巷歌曲、布鲁斯、爵士乐、摇滚乐、索尔音乐等美国大众音乐架构基础上发展起来的音乐。其风格多样，形态丰富，可泛指Jazz、Rock、Soul、Blues、Reggae、Rap、Hip-Hop、Disco、New Age、Funk、R&B等20世纪后诞生的都市化大众商品音乐。";
QString pop_1="流行音乐的起源可以追溯到20世纪初的美国，当时广播、录音和唱片技术的发展促进了音乐的传播和普及。流行音乐吸收了爵士、蓝调、乡村和民谣等多种音乐风格的影响，通过简单易懂的旋律和歌词，迅速赢得了大众的喜爱。这些音乐反映了当时社会的文化和心理变化，同时也反映了青少年文化的兴起和发展。艺术家如乔治·格什温、艾尔维斯·普雷斯利和比尔·黑利等人，通过他们的音乐作品，为流行音乐奠定了基础。随着广播电台的普及和音乐录音技术的进步，流行音乐迅速扩展到全球，并在20世纪中期成为主流文化的一部分，持续影响至今。";
QString pop_2="流行音乐涵盖了多种风格和流派，如流行摇滚、流行电子、流行舞曲和流行嘻哈等。其特点在于通俗易懂的旋律和歌词，以及广泛吸引力的节奏和曲调。流行音乐常使用电吉他、电子合成器、鼓机等现代乐器，借助先进的音乐制作技术增强音效和节奏感。歌词内容涉及个人情感、爱情、社会议题和日常生活，旨在与广大听众建立情感共鸣。流行音乐通过音乐会、音乐视频和舞台表演等多种形式传播和表现，持续演化和创新，反映了时代变迁和文化多样性。由于其商业化和大众化特性，流行音乐在全球音乐市场中占据重要地位，并对全球文化产生深远影响。";
QString pop_3="taylor swift：《cruel summer》";

QString path_now="Anything";


QString trysth="C:\\Users\\liang\\Desktop\\《夜的第七章》伴奏.mp3";
//QString path_classic="D:/Lishuhua/qt_projects/RealBigHomework/music/blue danube.mp3";
QString path_classic="../../music/blue danube.mp3";
QString path_jazz="../../music/What a wonderful world.mp3";
QString path_rock="../../music/It's my life.mp3";
QString path_pop="../../music/cruel summer.mp3";

QString blue="《蓝色多瑙河》（Blue Danube）是约翰·施特劳斯二世创作的最著名的圆舞曲之一，于1866年首演。其轻快的旋律和优美的旋律线使其成为维也纳新年音乐会的经典曲目之一，也是奥地利文化的象征。这首曲子以多瑙河为灵感，通过优雅的节奏和流畅的旋律，描绘了多瑙河优美的景色和维也纳的风情，深受世界各地听众的喜爱。";
QString waww="《What a Wonderful World》 是由路易·阿姆斯壮（Louis Armstrong）演唱的经典歌曲，1967年发行。这首歌歌颂了世界上美好的事物，如蓝天、白云、彩虹、花朵等，表达了对生活的乐观态度和热爱。它不仅在音乐上深受欢迎，还成为了一首象征和传递希望、和平与美好的歌曲。";
QString myLife= "《It's My Life》是由邦·乔维（Bon Jovi）乐队演唱的摇滚歌曲，于2000年发行。这首歌以强烈的旋律和充满力量的歌词表达了自主和坚持的精神，鼓励人们积极面对生活挑战并追求自己的梦想。它成为了一首深受全球青少年和成人喜爱的经典摇滚歌曲，象征着自由、勇气和冒险精神。";
QString cruel_summer="《Cruel Summer》是泰勒·斯威夫特的歌曲，收录于她的专辑《Lover》中。这首歌曲融合了流行、电子、摇滚等风格，旋律动感且富有感染力。歌词描绘了夏天经历背叛和伤害后的复杂心情，同时传达了即使面对痛苦也能坚强前行的希望。该曲深受听众喜爱，具有广泛影响力。";
