#include "Texts.h"


QString classic_0="古典音乐，是音乐的一种类型。古典音乐有广义、狭义之分。广义是指那些从西方中世纪开始的、在欧洲主流文化背景下创作的西方古典音乐，主要因其复杂多样的创作技术和所能承载的厚重内涵而有别于通俗音乐和民间音乐。狭义指古典主义时期，1750年（J·S·巴赫去世）至1827年（贝多芬去世），这一时期为古典主义音乐时期，它包含了两大时间段：“前古典时期”和“维也纳古典时期”。“最为著名的维也纳乐派也是在“维也纳古典时期”兴起，其代表作曲家有海顿、莫扎特和贝多芬，被后世称为“维也纳三杰”。";
QString classic_1="这里有一段古典的起源";
QString classic_2="classic_2还没想好。";
QString classic_3="贝多芬《命运交响曲》 莫扎《魔笛》";

QString jazz_0="爵士音乐（Jazz），音乐类型，于19世纪末20世纪初源于美国，诞生于南部港口城市新奥尔良，音乐根基来自布鲁斯（Blues）和拉格泰姆（Ragtime）。爵士乐讲究即兴，以具有摇摆特点的Shuffle节奏为基础，是非洲黑人文化和欧洲白人文化的结合。20世纪前十几年爵士乐主要集中在新奥尔良发展，1917年后转向芝加哥，30年代又转移至纽约，爵士乐风靡全球。爵士乐的主要风格有：新奥尔良爵士乐、摇摆乐、比博普、冷爵士、自由爵士乐、拉丁爵士、融合爵士等。";
QString jazz_1="jazz_1还没想好。";
QString jazz_2="这里是爵士的分类和特色呵呵呵呵呵。";
QString jazz_3="还没想好。";

QString rock_0="摇滚（Rock and Roll）是一种音乐类型，起源于20世纪40年代末期的美国，20世纪50年代早期开始流行，迅速风靡全球。摇滚乐以其灵活大胆的表现形式和富有激情的音乐节奏表达情感，受到了全世界大多数人的喜爱，并在1960年和1970年形成一股热潮。";
QString rock_1="rock_1还没想好。";
QString rock_2="还没想好。";
QString rock_3="自然也没想好。";

QString pop_0="流行音乐19世纪末20世纪初起源于美国，从音乐体系看，流行音乐是在叮砰巷歌曲、布鲁斯、爵士乐、摇滚乐、索尔音乐等美国大众音乐架构基础上发展起来的音乐。其风格多样，形态丰富，可泛指Jazz、Rock、Soul、Blues、Reggae、Rap、Hip-Hop、Disco、New Age、Funk、R&B等20世纪后诞生的都市化大众商品音乐。";
QString pop_1="pop_1还没想好。";
QString pop_2="pop_2还没想好。";
QString pop_3="pop_3还没想好。";

